core/app/Http/Controllers/SiteController.php

select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
---
    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }
        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','home')->first();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'about-us' limit 1
---
    public function pages($slug)
    {
        $page = Page::where('tempname',$this->activeTemplate)->where('slug',$slug)->firstOrFail();

select * from `donors` where `status` = 1 and `id` = 3 limit 1
---
    public function donorDetails($slug, $id)
    {
        $pageTitle = "Donor Details";
        $donor = Donor::where('status',1)->where('id', decrypt($id))->firstOrFail();

select `id`, `name` from `locations` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
select count(*) as aggregate from `donors` where `status` = 1 and `blood_id` = '2' and `city_id` = '1' and `location_id` = '1' and `gender` = '1'
---
    public function donorSearch(Request $request)
    {
        $request->validate([
            'location_id' => 'nullable|exists:locations,id',
            'city_id' => 'nullable|exists:cities,id',
            'blood_id' => 'nullable|exists:bloods,id',
            'gender' => 'nullable|in:1,2'
        ]);
        $locations = Location::where('status', 1)->select('id', 'name')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
        $pageTitle = "Donor Search";
        $emptyMessage = "No data found";
        $locationId = $request->location_id;
        $cityId = $request->city_id;
        $bloodId = $request->blood_id;
        $gender = $request->gender;
        $donors = Donor::where('status', 1);
        if($request->blood_id){
            $donors = $donors->where('blood_id', $request->blood_id);
        }
        if($request->city_id){
            $donors = $donors->where('city_id', $request->city_id);
        }
        if($request->location_id){
            $donors = $donors->where('location_id', $request->location_id);
        }
        if($request->gender){
            $donors = $donors->where('gender', $request->gender);
        }
        $donors = $donors->with('blood', 'location')->paginate(getPaginate());

select * from `bloods` where `status` = 1 and `id` = 1 limit 1
select `id`, `name` from `bloods` where `status` = 1
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `locations` where `status` = 1
select * from `bloods` where `bloods`.`id` in (1)
select * from `donors` where `status` = 1 and `blood_id` = 1 limit 20 offset 0
select * from `locations` where `locations`.`id` in (1)
select count(*) as aggregate from `donors` where `status` = 1 and `blood_id` = 1
---
    public function bloodGroup($slug, $id)
    {
        $blood = Blood::where('status', 1)->where('id', decrypt($id))->firstOrFail();
        $pageTitle = $blood->name." Blood Group Donor";
        $emptyMessage = "No data found";
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();
        $cities = City::where('status', 1)->select('id', 'name')->get();
        $locations = Location::where('status', 1)->select('id', 'name')->get();
        $donors = Donor::where('status',1)->where('blood_id', $blood->id)->with('blood', 'location')->paginate(getPaginate());

select * from `languages` where `code` = 'hn' limit 1
---
    public function changeLanguage($lang = null)
    {
        $language = Language::where('code', $lang)->first();

select * from `frontends` where `data_keys` = 'blog.element' limit 9 offset 0
select count(*) as aggregate from `frontends` where `data_keys` = 'blog.element'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'blog' limit 1
---
    public function blog(){
        $pageTitle = "Blog";
        $blogs = Frontend::where('data_keys','blog.element')->paginate(9);
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','blog')->first();

select * from `locations` where `locations`.`city_id` in (1)
select `id`, `name` from `cities` where `status` = 1
select `id`, `name` from `bloods` where `status` = 1
---
    public function applyDonor()
    {
        $pageTitle = "Apply as a Donor";
        $cities = City::where('status', 1)->select('id', 'name')->with('location')->get();
        $bloods = Blood::where('status', 1)->select('id', 'name')->get();

insert into `donors` (`name`, `email`, `phone`, `city_id`, `blood_id`, `location_id`, `gender`, `religion`, `profession`, `address`, `details`, `total_donate`, `birth_date`, `last_donate`, `socialMedia`, `image`, `username`, `password`, `updated_at`, `created_at`) values ('Paula Ellis', 'rule@mailinator.com', '8137059029', '1', '1', '1', '1', 'Islam', 'Engineer', '66 North Old Freeway', 'gnxzhfgh j chhjf,h', '12', '1995-12-18 00:00:00', '2022-06-01 00:00:00', '{\"facebook\":\"fzdnbdn\",\"twitter\":\"hfmcgxhmcg\",\"linkedinIn\":\"ftgnxf\",\"instagram\":\"dtjy\"}', '62c06695c74b61656776341.png', 'aman', '$2y$10$QSEuIJ4.A19nwg.HKxZrjur298X5EKNEhB9.u/qHM0gfon7i6F/Z2', '2022-07-02 15:39:02', '2022-07-02 15:39:02')
---
        }
        $donor->username = $request->username;
        $donor->password = Hash::make($request->password);
        $donor->save();