core/app/Http/Controllers/Donor/DonorController.php

select count(*) as aggregate from `bloods`
select count(*) as aggregate from `cities`
select count(*) as aggregate from `locations`
select count(*) as aggregate from `advertisements`
select count(*) as aggregate from `donors`
select count(*) as aggregate from `donors` where `status` = 0
select count(*) as aggregate from `donors` where `status` = 1
select * from `bloods` where `bloods`.`id` in (1)
select * from `donors` order by `id` desc limit 8
select * from `locations` where `locations`.`id` in (1)
---
    public function dashboard()
    {
        $pageTitle = 'Dashboard';
        $blood = Blood::count();
        $city = City::count();
        $locations = Location::count();
        $ads = Advertisement::count();
        $don['all'] = Donor::count();
        $don['pending'] = Donor::where('status', 0)->count();
        $don['approved'] = Donor::where('status', 1)->count();
        $don['banned'] = Donor::where('status', 0)->count();
        $donors = Donor::orderBy('id', 'DESC')->with('blood', 'location')->limit(8)->get();